Revit 2027 API
ScheduleFilterType Enumeration
 Type of schedule filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleFilterType
Public Enumeration ScheduleFilterType
public enum class ScheduleFilterType
type ScheduleFilterType
Members
Member name | Value | Description
BeginsWith | 10 |  For a string field, the field value begins with the specified string.
Contains | 8 |  For a string field, the field value contains the specified string.
EndsWith | 12 |  For a string field, the field value ends with specified string.
Equal | 2 |  The field value is equal to the specified value.
GreaterThan | 4 |  The field value is greater than the specified value.
GreaterThanOrEqual | 5 |  The field value is greater than or equal to the specified value.
HasNoValue | 17 |  The element does not have a value for the specified parameter. No value is specified.
HasParameter | 1 |  The element has the parameter specified by the field. Used with shared parameters. No value is specified for this filter type.
HasValue | 16 |  The element has a value for the specified parameter. No value is specified.
Invalid | 0 |  An invalid filter. Do not use.
IsAssociatedWithGlobalParameter | 14 |  The field is associated with a specified global parameter of a compatible type
IsNotAssociatedWithGlobalParameter | 15 |  The field is not associated with a specified global parameter of a compatible type
LessThan | 6 |  Less The field value is less than to the specified value.
LessThanOrEqual | 7 |  The field value is less than or equal to the specified value.
NotBeginsWith | 11 |  For a string field, the field value does not begin with the specified string.
NotContains | 9 |  For a string field, the field value does not contain the specified string.
NotEndsWith | 13 |  For a string field, the field value does not end with the specified string.
NotEqual | 3 |  The field value is not equal to the specified value.
See Also
Reference
Autodesk.Revit.DB Namespace